In [8]:
import pandas as pd
df= pd.DataFrame({'col1':[1,2,3,4], 'col2': ['abc','def','ghi','xyz'], 'col3': [111,222,333,444]})
df

   col1 col2  col3
0     1  abc   111
1     2  def   222
2     3  ghi   333
3     4  xyz   444

In [10]:
df.head()

   col1 col2  col3
0     1  abc   111
1     2  def   222
2     3  ghi   333
3     4  xyz   444

In [11]:
df.tail()

   col1 col2  col3
0     1  abc   111
1     2  def   222
2     3  ghi   333
3     4  xyz   444

In [15]:
df.shape

(4, 3)

In [17]:
df.count()

col1    4
col2    4
col3    4
dtype: int64

In [24]:
df['col2'].count()

4

In [25]:
df['col2'].unique()

array(['abc', 'def', 'ghi', 'xyz'], dtype=object)

In [27]:
df.col2.unique()

array(['abc', 'def', 'ghi', 'xyz'], dtype=object)

In [28]:
df['col2'].nunique()

4

In [36]:
df["col2"].value_counts()

col2
abc    1
def    1
ghi    1
xyz    1
Name: count, dtype: int64

In [39]:
import numpy as np
df1= pd.DataFrame({'col1':[np.nan,2,3,4,5,6], 'col2': ['abc','def',np.nan,'xyz','pqr','def'], 'col3': [111,222,np.nan,444,111,555]})
df1

   col1 col2   col3
0   NaN  abc  111.0
1   2.0  def  222.0
2   3.0  NaN    NaN
3   4.0  xyz  444.0
4   5.0  pqr  111.0
5   6.0  def  555.0

In [40]:
df1.head()

   col1 col2   col3
0   NaN  abc  111.0
1   2.0  def  222.0
2   3.0  NaN    NaN
3   4.0  xyz  444.0
4   5.0  pqr  111.0

In [42]:
df1.tail()

   col1 col2   col3
1   2.0  def  222.0
2   3.0  NaN    NaN
3   4.0  xyz  444.0
4   5.0  pqr  111.0
5   6.0  def  555.0

In [43]:
df1['col2'].unique()

array(['abc', 'def', nan, 'xyz', 'pqr'], dtype=object)

In [44]:
df1['col2'].nunique()

4

In [45]:
df1.shape

(6, 3)

In [46]:
df1['col2'].value_counts()

col2
def    2
abc    1
xyz    1
pqr    1
Name: count, dtype: int64

In [56]:
df1.sort_values('col2')

   col1 col2   col3
0   NaN  abc  111.0
1   2.0  def  222.0
5   6.0  def  555.0
4   5.0  pqr  111.0
3   4.0  xyz  444.0
2   3.0  NaN    NaN

In [60]:
df1.isnull()

    col1   col2   col3
0   True  False  False
1  False  False  False
2  False   True   True
3  False  False  False
4  False  False  False
5  False  False  False

In [63]:
df1.dropna()

   col1 col2   col3
1   2.0  def  222.0
3   4.0  xyz  444.0
4   5.0  pqr  111.0
5   6.0  def  555.0